Repository: rafaelortizzableh/portfolio
Catalog: lib/core/l10n/arb/app_*.arb
Languages: es

# appName
source: Rafael Ortiz - Software Developer
es: Rafael Ortiz - Desarrollador de Software

# appTitle
source: Rafael Ortiz Zableh - Portfolio
es: Rafael Ortiz Zableh - Portafolio

source: Software Developer
es: Desarrollador de Software

source: Projects
es: Proyectos

source: About
es: Acerca de

source: Contact
es: Contacto

source: About Me
es: Acerca de mí

source: Languages
es: Idiomas

source: English
es: Inglés

source: Spanish
es: Español

source: Italian
es: Italiano

source: Catalan
es: Catalán

# closeCta
source: Close
es: Cerrar

# fullScreenCta
source: Full Screen
es: Pantalla completa

# previousImageCta
source: Previous Image
es: Imagen anterior

# nextImageCta
source: Next Image
es: Imagen siguiente

# viewProjectCta
source: View {project}
es: Ver proyecto de {project}

# viewMoreDetailsCta
source: More Details
es: Ver más detalles

source: Tools and Technologies
es: Herramientas y tecnologías

# joinBuzzProjectDescription
source: Lead the technical efforts of pivoting from a video-calling web application for hybrid teams, into a menu bar app for product teams and software developers. The requirements included integrating with third party APIs from Github, Google Calendar, Slack, Microsoft, etc. The app shows you relevant information about your current workday as well as your teammates' in real time. Custom notifications are also shown: - When you have a meeting coming up, you get a notification that allows you to join with a single click. - When your pull request has any updates, like comments, review requests, or approvals, you get a notification that allows you to open the pull request.
es: Lideré los esfuerzos técnicos para cambiar una aplicación web de videollamadas para equipos híbridos a una aplicación de barra de menú para equipos de productos y desarrolladores de software. Los requisitos incluían la integración con APIs de terceros de Github, Google Calendar, Slack, Microsoft, etc. La aplicación muestra información relevante sobre tu jornada laboral actual y la de tus compañeros en tiempo real. También se muestran notificaciones personalizadas: - Cuando tienes una reunión próxima, recibes una notificación que te permite unirte con un solo clic. - Cuando tu solicitud de extracción tiene alguna actualización, como comentarios, solicitudes de revisión o aprobaciones, recibes una notificación que te permite abrir la solicitud de extracción.

# miTransicionProjectDescription
source: Designed and developed an app that allows patients of facial feminization to manage all aspects of their medical process, from scheduling appointments, to seeing simulations of their facial changes, paying for their procedure and more. Additionally, developed a backoffice for the medical center's staff to manage all aspects of the patients' process, including scheduling appointments, managing payments, and more
es: Diseñé y desarrollé una aplicación que permite a los pacientes de feminización facial gestionar todos los aspectos de su proceso médico, desde programar citas hasta ver simulaciones de los cambios faciales, pagar por su procedimiento y más. Además, desarrollé un backoffice para el personal del centro médico para gestionar todos los aspectos del proceso de los pacientes, incluyendo programar citas, gestionar pagos y más.

# zurichOneAppProjectDescription
source: Built features for the One Zurich App mobile app. Among the challenges faced by my team were: - Adding support for MSAL through Platform Channels (Swift + Kotlin). - Adding support for SVG floor plane maps. - Implementing a custom a Flutter Web backoffice for the app's content management system.
es: Desarrollé funcionalidades para la aplicación móvil One Zurich App. Entre los desafíos que enfrentó mi equipo se encuentran: - Agregar soporte para MSAL a través de Platform Channels (Swift + Kotlin). - Agregar soporte para mapas de planos de piso SVG. - Implementar un backoffice personalizado de Flutter Web para el sistema de gestión de contenido de la aplicación.

# fundacionSaludSiglo21ProjectDescription
source: I was in charge of the techincal aspects of the digitalization process of the Fundaci√≥n Salud Siglo 21, a non-profit organization that provides medical services to vulnerable communities in Colombia. This included: - Overseeing the non-profit's rebranding process. - Creating a new website for the foundation. - Creating a full-stack web app that allows users to register, update their information, and pay the yearly membership fees both through physical payments and bank transfers. The app includes integrations with third party APIs for payments, insertion of data into their CRM and Google Sheets, among others. - Creating a directory web app that allows users to find medical practitioners, filtering by specializations, subspecializations, and medical procedures offered. - Providing consulting services for the non-profit's digitalization process. This included a Social Media and basic design training.
es: Me encargué de los aspectos técnicos del proceso de digitalización de la Fundación Salud Siglo 21, una organización sin fines de lucro que brinda servicios médicos a comunidades vulnerables en Colombia. Esto incluyó: - Supervisar el proceso de cambio de imagen de la organización sin fines de lucro. - Crear un nuevo sitio web para la fundación. - Crear una aplicación web de pila completa que permite a los usuarios registrarse, actualizar su información y pagar las cuotas de membresía anuales tanto a través de pagos físicos como transferencias bancarias. La aplicación incluye integraciones con APIs de terceros para pagos, inserción de datos en su CRM y Google Sheets, entre otros. - Crear una aplicación web de directorio que permite a los usuarios encontrar profesionales médicos, filtrando por especializaciones, subespecializaciones y procedimientos médicos ofrecidos. - Brindar servicios de consultoría para el proceso de digitalización de la organización sin fines de lucro. Esto incluyó capacitación en redes sociales y diseño básico.

# profesionalesDeLaSaludProjectDescription
source: - Created a website for the medical practice. - Created a web app for scheduling appointments based on their requirements. - Created serverless automations for the appointment scheduling process, including integrations with third party APIs.
es: - Creé un sitio web para el grupo médico. - Creé una aplicación web para programar citas según sus requisitos. - Creé automatizaciones sin servidor para el proceso de programación de citas, incluyendo integraciones con APIs de terceros.

# centroMedicoCALProjectDescription
source: Oversaw the medical center's rebranding process. Created a website for the medical center, including a custom secion for the medical center's directory of medical practitioners.
es: Supervisé el proceso de cambio de imagen del centro médico. Creé un sitio web para el centro médico, incluyendo una sección personalizada para el directorio de profesionales médicos del centro.

# centroUrologicoFoscalProjectDescription
source: - Oversaw the medical practice's rebranding process. - Created a website for the medical practice. - Provided maintenance and support for the medical practice's website. - Provided consulting services for the medical practice's digitalization process. - Provided internal and external communications consulting services for the medical practice. - Created and implemented a successful SEO strategy for the medical practice.
es: - Supervisé el proceso de cambio de imagen de el grupo médico. - Creé un sitio web para el grupo médico. - Brindé mantenimiento y soporte para el sitio web de el grupo médico. - Brindé servicios de consultoría para el proceso de digitalización de el grupo médico. - Brindé servicios de consultoría en comunicaciones internas y externas para el grupo médico. - Creé e implementé una estrategia exitosa de SEO para el grupo médico.

# spectMedicinaNuclearProjectDescription
source: - Created a website for the medical practice. - Provided maintenance and support for the medical practice's website. - Created and implemented a successful SEO strategy for the medical practice.
es: - Creé un sitio web para el grupo médico. - Brindé mantenimiento y soporte para el sitio web de el grupo médico. - Creé e implementé una estrategia exitosa de SEO para el grupo médico.

# elCieloDeMilaProjectDescription
source: - Created a website for the non-profit store. - Provided maintenance and support for the non-profit's website.
es: - Creé un sitio web para la tienda sin ánimo de lucro. - Brindé mantenimiento y soporte para el sitio web de la tienda sin fines de lucro.

# aquaBottlesProjectDescription
source: - Created an e-commerce website for the water bottles business. - Created serverless automations to record new purchases and abandonded shopping carts on Google Sheets and send notifications on Telegram. - Provided maintenance and support for the website.
es: - Creé un sitio web de comercio electrónico para el negocio de botellas de agua. - Creé automatizaciones sin servidor para registrar nuevas compras y carritos de compra abandonados en Google Sheets y enviar notificaciones en Telegram. - Brindé mantenimiento y soporte para el sitio web.

# mascootyProjectDescription
source: Designed and developed the MVP of a mobile application that allows pet owners to sell and buy pet products and services.
es: Diseñé y desarrollé el MVP de una aplicación móvil que permite a los dueños de mascotas vender y comprar productos y servicios para mascotas.

# allInBikingProjectDescription
source: Designed and developed the first iteration of the MVP of a mobile application that allows bike owners to register their bikes, and in case of theft, report it and get help from the community to find it; as well as ride with other bikers.
es: Diseñé y desarrollé la primera iteración del MVP de una aplicación móvil que permite a los propietarios de bicicletas registrar sus bicicletas y, en caso de robo, reportarlo y obtener ayuda de la comunidad para encontrarla; así como también andar con otros ciclistas.

# descupAppProjectDescription
source: Developed features and fixed bugs for the Descup App mobile app. The app allows users to find better deals for their utilities.
es: Desarrollé funcionalidades y corregí errores para la aplicación móvil Descup App. La aplicación permite a los usuarios encontrar mejores ofertas para sus servicios públicos.

# ingeoExpertProjectDescription
source: Developed features for the e-learning platform's mobile app. - Created a custom video player that allows users to view videos without using Vimeo. - Created a custom PDF viewer that allows users to view PDFs without using Google Drive. - Integrated the app with Wordpress and Moodle APIs to allow users to purchase and view courses. - Added support for social media login. - Improve the app's UX/UI design based on requirements.
es: Desarrollé funcionalidades para la aplicación móvil de la plataforma de aprendizaje en línea. - Creé un reproductor de video personalizado que permite a los usuarios ver videos sin usar Vimeo. - Creé un visor de PDF personalizado que permite a los usuarios ver PDFs sin usar Google Drive. - Integré la aplicación con las APIs de Wordpress y Moodle para permitir a los usuarios comprar y ver cursos. - Agregué soporte para inicio de sesión con redes sociales. - Mejoré el diseño UX/UI de la aplicación según los requisitos.
